Revit 2027 API
PrintParameters.HideReforWorkPlanes Property
 Indicates whether to hide reference/work planes when printing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HideReforWorkPlanes { get; set; }
Public Property HideReforWorkPlanes As Boolean
	Get
	Set
public:
property bool HideReforWorkPlanes {
	bool get ();
	void set (bool value);
}
member HideReforWorkPlanes : bool with get, set
Property Value
Boolean
See Also
Reference
PrintParameters Class
Autodesk.Revit.DB Namespace